tutorials/case_channel_parabolic_U/0/psi.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }

    outlet    
    {
        type            zeroGradient;
    }


    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    bottom
    {
        type            zeroGradient;
        value uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
